{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 128,
  "id2label": {
    "0": "Accountability",
    "1": "Accuracy/reliability",
    "2": "Appropriation",
    "3": "Authenticity/integrity",
    "4": "Consent",
    "5": "Dual use",
    "6": "Employment/labour",
    "7": "Fairness",
    "8": "Human rights/civil liberties",
    "9": "Mis/disinformation",
    "10": "Privacy/surveillance",
    "11": "Safety",
    "12": "Security",
    "13": "Transparency"
  },
  "initializer_range": 0.02,
  "intermediate_size": 512,
  "label2id": {
    "Accountability": 0,
    "Accuracy/reliability": 1,
    "Appropriation": 2,
    "Authenticity/integrity": 3,
    "Consent": 4,
    "Dual use": 5,
    "Employment/labour": 6,
    "Fairness": 7,
    "Human rights/civil liberties": 8,
    "Mis/disinformation": 9,
    "Privacy/surveillance": 10,
    "Safety": 11,
    "Security": 12,
    "Transparency": 13
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 2,
  "num_hidden_layers": 2,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "transformers_version": "4.57.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
